# Напишите программу, которая преобразует строку, в которой записаны слова через “,” в список из этих слов


if __name__ == '__main__':
    line = 'ooojuoi, tyiu, ll, , k'
    array = line.split(', ')
    print(array)
