# Напишите программу, которая преобразует строку, в которой записаны слова через “,” в список из этих слов


if __name__ == '__main__':
    line = 'ooojuoi, tyiu, ll, , k'

<<<<<<< HEAD
    array = line.split(', ')
    print(array)
=======
    print(array) 
>>>>>>> 7f6936377cf62bf4f297893c7b2929436b5d6406
