# Выведите текущее время в любом формате

import datetime
if __name__=='__main__':

    print(datetime.datetime.now())